-- DLI sql 
-- ******************************************************************** --
-- author: chenzhigao
-- create time: 2025/03/08 00:25:36 GMT+08:00
-- ******************************************************************** --
select 
    mt
    ,日期
    ,dt
    ,供给部门
    ,一级市场
    ,二级市场
    ,三级市场
    ,季节
    ,一级品类
    ,二级品类
    ,三级品类
    ,round((SUM(现货场gmv)-SUM(前置仓现货场销售gmv)),4) as 现货场库存清理gmv
    ,round(sum(货场拿货额) - sum(前置仓现货场销售拿货额),4) as 现货场库存清理拿货额
    ,round(((SUM(现货场gmv)-SUM(前置仓现货场销售gmv)) + SUM(预售场折扣gmv)) / ((sum(货场拿货额) - sum(前置仓现货场销售拿货额)) + SUM(预售场折扣拿货额)),4) as 折扣率
    ,sum(预售场折扣销量) + (sum(现货场销量) - sum(前置仓现货场销售数量)) as 现货清理销量
    ,sum(预售场折扣拿货额) + (sum(货场拿货额) - sum(前置仓现货场销售拿货额)) as 现货清理拿货额
    ,round(SUM(预售场折扣gmv) + (SUM(现货场gmv)-SUM(前置仓现货场销售gmv)),4) as 现货清理gmv
    ,round((SUM(现货场gmv)-SUM(前置仓现货场销售gmv)) / (sum(货场拿货额) - sum(前置仓现货场销售拿货额)),4) as 现货场库存折扣率
    ,sum(现货场销量) - sum(前置仓现货场销售数量) as 现货场库存清理数量
    ,round(sum(预售场折扣gmv) / sum(预售场折扣拿货额),4) as 预售现货折扣
    ,round(sum(预售场折扣销量),4) 预售场折扣销量
    ,round(sum(预售场折扣拿货额),4) 预售场折扣拿货额
    ,round(sum(预售场折扣gmv),4) 预售场折扣gmv
    ,sum(现货场销量) 现货场销量
    ,sum(货场拿货额) 货场拿货额
    ,sum(现货场gmv) 现货场gmv
    ,sum(前置仓现货场销售数量) 前置仓现货场销售数量
    ,sum(前置仓现货场销售拿货额) 前置仓现货场销售拿货额
    ,sum(前置仓现货场销售gmv) 前置仓现货场销售gmv
    ,sum(现货清理数量) 现货清理数量
from dw_yishou_daily.finebi_cwf_in_stock_goods_loss
where 日期 >= date'${开始日期}' and 日期 <= date'${结束日期}'
group by 1,2,3,4,5,6,7,8,9,10,11
